$('.nav_bg').height(screen.availHeight);
$('.nav').height(screen.availHeight);
// $('.cover_row .row_item:nth-of-type(3)').height($('.cover_row img').width()*0.93 - 50)

// todo 根据屏幕高度自动调节nav

function createEchart(id, option){
    var myChart = echarts.init(document.getElementById(id), 'light');
    myChart.setOption(option, true);
}
option = {
    // title: {
    //     text: '总评分'
    // },
    tooltip: {
        trigger: 'axis'
    },
    radar: [
        {
            indicator: [
                {text: '制作班底与演员', max: 10},
                {text: '背景实力', max: 10},
                {text: '内容质量', max: 10},
                {text: '潮流与关注程度', max: 10},
                {text: '用户评价', max: 10},
                {text: '历史表现', max: 10}
            ],
            center: ['50%','50%'],
            radius: 50
        },
    ],
    textStyle: {
        color: '#fff',
    },
    series: [
        {
            type: 'radar',
             tooltip: {
                trigger: 'item'
            },
            itemStyle: {normal: {areaStyle: {type: 'default'}}},
            areaStyle:{
                shadowColor: '#0000ff',
            },
            data: [
                {
                    value: [8,8.5,9,9,9,9],
                    name: '延禧攻略'
                }
            ]
        },
    ],
    color: ['#60D9F9','#00ff00', '#ff0000', '#00ff00', '#ffffff','#eee',  '#ccc', '#00ff00','#ff0000', '#0000ff', '#00ff00'],
    // color: ['#c23531','#2f4554', '#61a0a8', '#d48265', '#91c7ae','#749f83',  '#ca8622', '#bda29a','#6e7074', '#546570', '#c4ccd3'],
};
createEchart('score_radar', option);




var hours = ['12a', '1a', '2a', '3a', '4a', '5a', '6a',
        '7a', '8a', '9a','10a','11a',
        '12p', '1p', '2p', '3p', '4p', '5p',
        '6p', '7p', '8p', '9p', '10p', '11p'];
var days = ['Sat', 'Fri', 'Thur',
        'Wed', 'Tues', 'Mon', 'Sun'];

var data = [[0,0,5],[0,1,1],[0,2,0],[0,3,0],[0,4,0],[0,5,0],[0,6,0],[0,7,0],[0,8,0],[0,9,0],[0,10,0],[0,11,2],[0,12,4],[0,13,1],[0,14,1],[0,15,3],[0,16,4],[0,17,6],[0,18,4],[0,19,4],[0,20,3],[0,21,3],[0,22,2],[0,23,5],[1,0,7],[1,1,0],[1,2,0],[1,3,0],[1,4,0],[1,5,0],[1,6,0],[1,7,0],[1,8,0],[1,9,0],[1,10,5],[1,11,2],[1,12,2],[1,13,6],[1,14,9],[1,15,11],[1,16,6],[1,17,7],[1,18,8],[1,19,12],[1,20,5],[1,21,5],[1,22,7],[1,23,2],[2,0,1],[2,1,1],[2,2,0],[2,3,0],[2,4,0],[2,5,0],[2,6,0],[2,7,0],[2,8,0],[2,9,0],[2,10,3],[2,11,2],[2,12,1],[2,13,9],[2,14,8],[2,15,10],[2,16,6],[2,17,5],[2,18,5],[2,19,5],[2,20,7],[2,21,4],[2,22,2],[2,23,4],[3,0,7],[3,1,3],[3,2,0],[3,3,0],[3,4,0],[3,5,0],[3,6,0],[3,7,0],[3,8,1],[3,9,0],[3,10,5],[3,11,4],[3,12,7],[3,13,14],[3,14,13],[3,15,12],[3,16,9],[3,17,5],[3,18,5],[3,19,10],[3,20,6],[3,21,4],[3,22,4],[3,23,1],[4,0,1],[4,1,3],[4,2,0],[4,3,0],[4,4,0],[4,5,1],[4,6,0],[4,7,0],[4,8,0],[4,9,2],[4,10,4],[4,11,4],[4,12,2],[4,13,4],[4,14,4],[4,15,14],[4,16,12],[4,17,1],[4,18,8],[4,19,5],[4,20,3],[4,21,7],[4,22,3],[4,23,0],[5,0,2],[5,1,1],[5,2,0],[5,3,3],[5,4,0],[5,5,0],[5,6,0],[5,7,0],[5,8,2],[5,9,0],[5,10,4],[5,11,1],[5,12,5],[5,13,10],[5,14,5],[5,15,7],[5,16,11],[5,17,6],[5,18,0],[5,19,5],[5,20,3],[5,21,4],[5,22,2],[5,23,0],[6,0,1],[6,1,0],[6,2,0],[6,3,0],[6,4,0],[6,5,0],[6,6,0],[6,7,0],[6,8,0],[6,9,0],[6,10,1],[6,11,0],[6,12,2],[6,13,1],[6,14,3],[6,15,4],[6,16,0],[6,17,0],[6,18,0],[6,19,0],[6,20,1],[6,21,2],[6,22,2],[6,23,6]];

data = data.map(function (item) {
    return [item[1], item[0], item[2] || '-'];
});

option = {
    tooltip: {
        position: 'top'
    },
    animation: false,
    grid: {
        height: '80%',
        width: '82%',
        y: '10%',
        x: '12%'
    },
    xAxis: {
        type: 'category',
        data: hours,
        splitArea: {
            show: true
        }
    },
    yAxis: {
        type: 'category',
        data: days,
        splitArea: {
            show: true
        }
    },
    visualMap: {
        min: 0,
        max: 10,
        calculable: true,
        orient: 'horizontal',
        left: 'center',
        bottom: '-100%'
    },
    series: [{
        name: '市场规律',
        type: 'heatmap',
        data: data,
        label: {
            normal: {
                show: true
            }
        },
        itemStyle: {
            emphasis: {
                shadowBlur: 10,
                shadowColor: 'rgba(0, 0, 0, 0.5)'
            }
        }
    }]
};
createEchart('mkt_heatmap', option);

option = {
    xAxis: {
        scale: true
    },
    yAxis: {
        scale: true
    },
    series: [{
        type: 'effectScatter',
        symbolSize: 20,
        data: [
            [172.7, 105.2],
            [153.4, 42]
        ]
    }, {
        type: 'scatter',
        data: [[161.2, 51.6], [167.5, 59.0], [159.5, 49.2], [157.0, 63.0], [155.8, 53.6],
            [170.0, 59.0], [159.1, 47.6], [166.0, 69.8], [176.2, 66.8], [160.2, 75.2],
            [172.5, 55.2], [170.9, 54.2], [172.9, 62.5], [153.4, 42.0], [160.0, 50.0],
            [147.2, 49.8], [168.2, 49.2], [175.0, 73.2], [157.0, 47.8], [167.6, 68.8],
            [159.5, 50.6], [175.0, 82.5], [166.8, 57.2], [176.5, 87.8], [170.2, 72.8],
            [174.0, 54.5], [173.0, 59.8], [179.9, 67.3], [170.5, 67.8], [160.0, 47.0],
            [154.4, 46.2], [162.0, 55.0], [176.5, 83.0], [160.0, 54.4], [152.0, 45.8],
            [162.1, 53.6], [170.0, 73.2], [160.2, 52.1], [161.3, 67.9], [166.4, 56.6],
            [168.9, 62.3], [163.8, 58.5], [167.6, 54.5], [160.0, 50.2], [161.3, 60.3],
            [167.6, 58.3], [165.1, 56.2], [160.0, 50.2], [170.0, 72.9], [157.5, 59.8],
            [167.6, 61.0], [160.7, 69.1], [163.2, 55.9], [152.4, 46.5], [157.5, 54.3],
            [168.3, 54.8], [180.3, 60.7], [165.5, 60.0], [165.0, 62.0], [164.5, 60.3],
            [156.0, 52.7], [160.0, 74.3], [163.0, 62.0], [165.7, 73.1], [161.0, 80.0],
            [162.0, 54.7], [166.0, 53.2], [174.0, 75.7], [172.7, 61.1], [167.6, 55.7],
            [151.1, 48.7], [164.5, 52.3], [163.5, 50.0], [152.0, 59.3], [169.0, 62.5],
            [164.0, 55.7], [161.2, 54.8], [155.0, 45.9], [170.0, 70.6], [176.2, 67.2],
            [170.0, 69.4], [162.5, 58.2], [170.3, 64.8], [164.1, 71.6], [169.5, 52.8],
            [163.2, 59.8], [154.5, 49.0], [159.8, 50.0], [173.2, 69.2], [170.0, 55.9],
            [161.4, 63.4], [169.0, 58.2], [166.2, 58.6], [159.4, 45.7], [162.5, 52.2],
            [159.0, 48.6], [162.8, 57.8], [159.0, 55.6], [179.8, 66.8], [162.9, 59.4],
            [161.0, 53.6], [151.1, 73.2], [168.2, 53.4], [168.9, 69.0], [173.2, 58.4],
            [171.8, 56.2], [178.0, 70.6], [164.3, 59.8], [163.0, 72.0], [168.5, 65.2],
            [166.8, 56.6], [172.7, 105.2], [163.5, 51.8], [169.4, 63.4], [167.8, 59.0],
            [159.5, 47.6], [167.6, 63.0], [161.2, 55.2], [160.0, 45.0], [163.2, 54.0],
            [162.2, 50.2], [161.3, 60.2], [149.5, 44.8], [157.5, 58.8], [163.2, 56.4],
            [172.7, 62.0], [155.0, 49.2], [156.5, 67.2], [164.0, 53.8], [160.9, 54.4],
            [162.8, 58.0], [167.0, 59.8], [160.0, 54.8], [160.0, 43.2], [168.9, 60.5],
            [158.2, 46.4], [156.0, 64.4], [160.0, 48.8], [167.1, 62.2], [158.0, 55.5],
            [167.6, 57.8], [156.0, 54.6], [162.1, 59.2], [173.4, 52.7], [159.8, 53.2],
            [170.5, 64.5], [159.2, 51.8], [157.5, 56.0], [161.3, 63.6], [162.6, 63.2],
            [160.0, 59.5], [168.9, 56.8], [165.1, 64.1], [162.6, 50.0], [165.1, 72.3],
            [166.4, 55.0], [160.0, 55.9], [152.4, 60.4], [170.2, 69.1], [162.6, 84.5],
            [170.2, 55.9], [158.8, 55.5], [172.7, 69.5], [167.6, 76.4], [162.6, 61.4],
            [167.6, 65.9], [156.2, 58.6], [175.2, 66.8], [172.1, 56.6], [162.6, 58.6],
            [160.0, 55.9], [165.1, 59.1], [182.9, 81.8], [166.4, 70.7], [165.1, 56.8],
            [177.8, 60.0], [165.1, 58.2], [175.3, 72.7], [154.9, 54.1], [158.8, 49.1],
            [172.7, 75.9], [168.9, 55.0], [161.3, 57.3], [167.6, 55.0], [165.1, 65.5],
            [175.3, 65.5], [157.5, 48.6], [163.8, 58.6], [167.6, 63.6], [165.1, 55.2],
            [165.1, 62.7], [168.9, 56.6], [162.6, 53.9], [164.5, 63.2], [176.5, 73.6],
            [168.9, 62.0], [175.3, 63.6], [159.4, 53.2], [160.0, 53.4], [170.2, 55.0],
            [162.6, 70.5], [167.6, 54.5], [162.6, 54.5], [160.7, 55.9], [160.0, 59.0],
            [157.5, 63.6], [162.6, 54.5], [152.4, 47.3], [170.2, 67.7], [165.1, 80.9],
            [172.7, 70.5], [165.1, 60.9], [170.2, 63.6], [170.2, 54.5], [170.2, 59.1],
            [161.3, 70.5], [167.6, 52.7], [167.6, 62.7], [165.1, 86.3], [162.6, 66.4],
            [152.4, 67.3], [168.9, 63.0], [170.2, 73.6], [175.2, 62.3], [175.2, 57.7],
            [160.0, 55.4], [165.1, 104.1], [174.0, 55.5], [170.2, 77.3], [160.0, 80.5],
            [167.6, 64.5], [167.6, 72.3], [167.6, 61.4], [154.9, 58.2], [162.6, 81.8],
            [175.3, 63.6], [171.4, 53.4], [157.5, 54.5], [165.1, 53.6], [160.0, 60.0],
            [174.0, 73.6], [162.6, 61.4], [174.0, 55.5], [162.6, 63.6], [161.3, 60.9],
            [156.2, 60.0], [149.9, 46.8], [169.5, 57.3], [160.0, 64.1], [175.3, 63.6],
            [169.5, 67.3], [160.0, 75.5], [172.7, 68.2], [162.6, 61.4], [157.5, 76.8],
            [176.5, 71.8], [164.4, 55.5], [160.7, 48.6], [174.0, 66.4], [163.8, 67.3]
        ],
    }]
};
createEchart('invest_scatter', option);


option = {
    series : [
        {
            name: '投资去向',
            type: 'pie',
            radius : '55%',
            center: ['40%', '50%'],
            data: [{name:'演员片酬',value:1},{name:'拍摄花费',value:9}],
            itemStyle: {
                emphasis: {
                    shadowBlur: 10,
                    shadowOffsetX: 0,
                    shadowColor: 'rgba(0, 0, 0, 0.5)'
                }
            }
        }
    ]
};
createEchart('invest_pie', option);

option = {
    tooltip: {},
    animationDurationUpdate: 1500,
    animationEasingUpdate: 'quinticInOut',
    series : [
        {   focusNodeAdjacency:true,
            type: 'graph',
            layout: 'none',
            symbolSize: 50,
            label: {
                normal: {
                    show: true
                }
            },
            // edgeSymbol: ['circle'],
            // edgeSymbolSize: [4, 10],
            edgeLabel: {
                normal: {
                    textStyle: {
                        fontSize: 20
                    }
                }
            },
            data: [{
                name: '吴谨言',
                x: 300,
                y: 200
            }, {
                name: '许凯',
                x: 800,
                y: 200
            }, {
                name: '佘诗曼',
                x: 550,
                y: 0
            }, {
                name: '惠楷栋',
                x: 550,
                y: 300
            }],
            // links: [],
            links: [{
                source: 0,
                target: 1,
                symbolSize: [5, 20],
                lineStyle: {
                    normal: {
                        // width: 5,
                        curveness: 0.2
                    },
                    hoverAnimation: true,
                }
            }, {
                source: 2,
                target: 3,
                lineStyle: {
                    normal: { curveness: 0.2 }
                }
            }, {
                source: 0,
                target: 2,
                lineStyle: {
                    normal: {
                        // width: 5,
                        curveness: 0.3
                    }
                }
            }, {
                source: 3,
                target: 1,
                lineStyle: {
                    normal: {
                        // width: 5,
                        curveness: 0.1
                    }
                }
            }, {
                source: 0,
                target: 3,
                lineStyle: {
                    normal: {
                        // width: 5,
                        curveness: -0.1
                    }
                }
            }, {
                source: 1,
                target: 2,
                lineStyle: {
                    normal: {
                        // width: 5,
                        curveness: -0.2
                    }
                }
            }],
            lineStyle: {
                normal: {
                    opacity: 0.9,
                    width: 2,
                    curveness: 0
                }
            }
        }
    ]
};
createEchart('actors_graph', option);


option = {    
    // title : {
    //     text: '近年不同电视剧题材的平均播放量',
    //     position:'center',
    // },
    calculable : true,
    xAxis : [
        {
            type : 'category',
            // data : ['1月','2月','3月','4月','5月','6月','7月','8月','9月','10月','11月','12月']
            data : ['古装','武侠','家庭','都市','战争','谍战','罪案','宫廷','神话','年代','商战','奇幻']
        }
    ],
    yAxis : [
        {
            type : 'value'
        }
    ],
    series : [
        {
            name:'蒸发量',
            type:'bar',
            data:[25, 30, 70, 46, 36, 76, 92, 73, 32, 20, 64, 33],
            markPoint : {
                data : [
                    {type : 'max', name: '最大值'},
                    {type : 'min', name: '最小值'}
                ]
            },
            markLine : {
                data : [
                    {type : 'average', name: '平均值'}
                ]
            }
        },
    ]
};
createEchart('mkt_adapt_bar', option);


option = {
    grid:{
        left: '18%',
    },
    legend: {
        data:['优酷播放量','爱奇艺播放量','总播放量']
    },
    xAxis: {
        type: 'category',
        data: ['2018-10-15', '2018-10-16', '2018-10-17', '2018-10-18', '2018-10-19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '优酷播放量',
        data: [4820, 4932, 4901, 5434, 4290, 5330, 4320],
        type: 'line'
    },{
        name: '爱奇艺播放量',
        data: [4120, 4032, 4301, 4434, 3890, 3330, 3620],
        type: 'line'
    },{
        name: '总播放量',
        data: [6820, 6932, 6901, 7434, 7290, 6330, 6720],
        type: 'line'
    }]
};
createEchart('hst_play_line', option);

option = {
    legend: {
        data:['总收视率']
    },
    xAxis: {
        type: 'category',
        data: ['2018-10-15', '2018-10-16', '2018-10-17', '2018-10-18', '2018-10-19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '总收视率',
        data: [5820, 5932, 5901, 6434, 6290, 5330, 5720],
        type: 'line'
    }]
};
createEchart('hst_watch_line', option);




option = {
    series : [
        {
            name: '投资去向',
            type: 'pie',
            radius : '55%',
            center: ['40%', '50%'],
            data: [{name:'演员片酬',value:1},{name:'拍摄花费',value:9}],
            itemStyle: {
                emphasis: {
                    shadowBlur: 10,
                    shadowOffsetX: 0,
                    shadowColor: 'rgba(0, 0, 0, 0.5)'
                }
            }
        }
    ]
};
createEchart('cmt_weibo_pie', option);
createEchart('cmt_news_pie', option);
createEchart('cmt_douban_pie', option);
createEchart('film_critics_pie', option);



option = {
    legend: {
        data:['微博数','二次转发数','评论数','点赞数']
    },
    grid:{
        left: '18%',
        height: '60%'
    },
    xAxis: {
        type: 'category',
        data: ['15', '16', '17', '18', '19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '微博数',
        data: [520, 532, 501, 534, 490],
        type: 'line'
    },{
        name: '二次转发数',
        data: [420, 432, 401, 404, 390],
        // data: [120, 332, 301, 434, 490, 330, 620],
        type: 'line'
    },{
        name: '评论数',
        data: [320, 332, 301, 294, 320],
        // data: [520, 532, 601, 334, 490, 430, 620],
        type: 'line'
    },{
        name: '点赞数',
        data: [430, 452, 451, 414, 450],
        // data: [820, 932, 901, 434, 490, 530, 620],
        type: 'line'
    }]
};
createEchart('msg_weibo_line', option);
option = {
    legend: {
        data:['文章数量','阅读数量','微信搜索数量']
    },
    grid:{
        left: '18%',
        height: '60%'
    },
    xAxis: {
        type: 'category',
        data: ['15', '16', '17', '18', '19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '文章数量',
        data: [520, 532, 501, 534, 490],
        type: 'line'
    },{
        name: '阅读数量',
        data: [420, 432, 401, 404, 390],
        // data: [120, 332, 301, 434, 490, 330, 620],
        type: 'line'
    },{
        name: '微信搜索数量',
        data: [320, 332, 301, 294, 320],
        // data: [520, 532, 601, 334, 490, 430, 620],
        type: 'line'
    }]
};
createEchart('msg_wechat_line', option);
option = {
    legend: {
        data:['新闻报道数量','新闻评论数量']
    },
    grid:{
        left: '18%',
        height: '60%'
    },
    xAxis: {
        type: 'category',
        data: ['15', '16', '17', '18', '19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '新闻报道数量',
        data: [520, 532, 501, 534, 490],
        type: 'line'
    },{
        name: '新闻评论数量',
        data: [420, 432, 401, 404, 390],
        // data: [120, 332, 301, 434, 490, 330, 620],
        type: 'line'
    }]
};
createEchart('msg_news_line', option);
option = {
    legend: {
        data:['百度关键词搜索指数']
    },
    grid:{
        left: '18%',
        height: '60%'
    },
    xAxis: {
        type: 'category',
        data: ['15', '16', '17', '18', '19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '百度关键词搜索指数',
        data: [520, 532, 501, 534, 490],
        type: 'line'
    }]
};
createEchart('msg_baidu_line', option);
option = {
    legend: {
        data:['平台想看数量统计']
    },
    grid:{
        left: '18%',
        height: '60%'
    },
    xAxis: {
        type: 'category',
        data: ['15', '16', '17', '18', '19']
    },
    yAxis: {
        type: 'value'
    },
    series: [{
        name: '平台想看数量统计',
        data: [520, 532, 501, 534, 490],
        type: 'line'
    }]
};
createEchart('msg_wish_line', option);



$('.explain_att').hover(function(){

})
// explain_cmt
// explain_hst
// explain_cont
// explain_act_1
// explain_act_2
// explain_bg_1
// explain_bg_2